Test Y_Deret/app/controllers/api/missions_controller.rb

SELECT "bookings".* FROM "bookings"
SELECT "missions".* FROM "missions"
INSERT INTO "missions" ("listing_id", "price", "mission_type", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?, ?)  [["listing_id", 16], ["price", 20], ["mission_type", "first_checkin"], ["created_at", "2022-09-15 13:32:34.020221"], ["updated_at", "2022-09-15 13:32:34.020221"], ["date", "2016-10-10"]]
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT 1 AS one FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."mission_type" = ? AND "missions"."date" = ? LIMIT ?  [["listing_id", 16], ["mission_type", "first_checkin"], ["date", "2016-10-10"], ["LIMIT", 1]]
INSERT INTO "missions" ("listing_id", "price", "mission_type", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?, ?)  [["listing_id", 16], ["price", 5], ["mission_type", "last_checkout"], ["created_at", "2022-09-15 13:32:34.035033"], ["updated_at", "2022-09-15 13:32:34.035033"], ["date", "2016-10-15"]]
SELECT 1 AS one FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."mission_type" = ? AND "missions"."date" = ? LIMIT ?  [["listing_id", 16], ["mission_type", "last_checkout"], ["date", "2016-10-15"], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations"
INSERT INTO "missions" ("listing_id", "price", "mission_type", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?, ?)  [["listing_id", 16], ["price", 10], ["mission_type", "checkout_checkin"], ["created_at", "2022-09-15 13:32:34.092984"], ["updated_at", "2022-09-15 13:32:34.092984"], ["date", "2016-10-13"]]
SELECT 1 AS one FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."date" = ? LIMIT ?  [["listing_id", 16], ["date", "2016-10-13"], ["LIMIT", 1]]
---
  def index
    Booking.all.each do |booking|
      mission = Mission.where(listing_id: booking.listing_id, mission_type: 'first_checkin', date: booking.start_date)
      Mission.create!(listing_id: booking.listing_id, mission_type: 'first_checkin', date: booking.start_date, price: 20) if mission.empty?
      mission = Mission.where(listing_id: booking.listing_id, mission_type: 'last_checkout', date: booking.end_date)
      Mission.create!(listing_id: booking.listing_id, mission_type: 'last_checkout', date: booking.end_date, price: 5) if mission.empty?
    end
    Reservation.all.each do |reservation|
      mission = Mission.where(listing_id: reservation.listing_id, date: reservation.end_date)
      Mission.create!(listing_id: reservation.listing_id, mission_type: 'checkout_checkin', date: reservation.end_date, price: 10) if mission.empty?